In [1]:
import pandas as pd

In [39]:
cliente = pd.read_excel('data/utf-8/Cliente.xlsx')
fornecedor = pd.read_excel('data/utf-8/Fornecedor.xlsx')
produto = pd.read_excel('data/utf-8/Produto.xlsx')
item = pd.read_excel('data/utf-8/Item.xlsx')
nota = pd.read_excel('data/utf-8/Nota.xlsx')

C:\Users\Lynda\anaconda3\Lib\site-packages\openpyxl\worksheet\_read_only.py:79: UserWarning: Unknown extension is not supported and will be removed
  for idx, row in parser.parse():
C:\Users\Lynda\anaconda3\Lib\site-packages\openpyxl\worksheet\_read_only.py:79: UserWarning: Unknown extension is not supported and will be removed
  for idx, row in parser.parse():
C:\Users\Lynda\anaconda3\Lib\site-packages\openpyxl\worksheet\_read_only.py:79: UserWarning: Unknown extension is not supported and will be removed
  for idx, row in parser.parse():
C:\Users\Lynda\anaconda3\Lib\site-packages\openpyxl\worksheet\_read_only.py:79: UserWarning: Unknown extension is not supported and will be removed
  for idx, row in parser.parse():
C:\Users\Lynda\anaconda3\Lib\site-packages\openpyxl\worksheet\_read_only.py:79: UserWarning: Unknown extension is not supported and will be removed
  for idx, row in parser.parse():

In [34]:
fornecedor

             CNPJ                   Razao_Social             Endereco   Cidade
0  17624092000185  Alpha Soluções em Informática  Rua 9 de Julho, 738  Marília
1  47132482000176        MicroSystem Informática   Av. da Saudade, 98    Bauru
2  56021482000112                   J.W Sistemas   Rua Paes Leme, 172  Marília
3  27385372000136                     ADABAS S/A  Rua 9 de Julho, 829  Marília

In [31]:
# Exercício 1: Qual o nome do cliente e a razão social ('Razao_Social') presente na tabela Cliente e Fornecedor?
pd.merge(cliente, fornecedor, on='Cidade')[['Nome', 'Razao_Social']]

                    Nome             Razao_Social
0  Sônia Santos Oliveira  MicroSystem Informática

In [ ]:
# Fazer o drop da coluna 'Endereco_x'
pd.merge(cliente, fornecedor, on='Cidade').drop('Endereco_x', axis=1)

In [40]:
# Exercício 2: Faça uma consulta que mostre a descrição e o estoque do produto e o nome do fornecedor do produto
# produto.merge(fornecedor, left_on='CNPJ_Fornecedor', right_on='CNPJ')[['Descricao', 'Estoque', 'Razao_Social']]
pd.merge(produto, fornecedor, left_on='CNPJ_Fornecedor', right_on='CNPJ')[['Descricao', 'Estoque', 'Razao_Social']]

          Descricao  Estoque                   Razao_Social
0  Micro Pentium IV       14                   J.W Sistemas
1  Impressora Epson        8                     ADABAS S/A
2       Disquete 3M       30  Alpha Soluções em Informática

In [48]:
# Exercício 3: Faça uma consulta que mostre o número, data e o nome do cliente de todas as notas
df2 = pd.merge(nota, cliente, left_on='Codigo_Cliente', right_on='Codigo' , how='left')[['Numero', 'Data', 'Nome']]

In [52]:
# Exercício 4: Encontre o registro (linha do DataFrame) em que há valor nulo
df2[df2.isnull().any(axis=1)]

   Numero       Data Nome
1    1002 2002-05-18  NaN

In [56]:
# Exercício 5: Faça uma consulta que mostre o nome do cliente e a soma das notas desse cliente
df = produto.merge(item, left_on='Codigo', right_on='Codigo_Produto').merge(nota, left_on='Numero_Nota', right_on='Numero').merge(cliente, left_on='Codigo_Cliente', right_on='Codigo')

In [59]:
df_nome_valor = df[['Nome', 'Valor']]

In [61]:
df_nome_valor.groupby('Nome')['Valor'].sum().to_frame()

                       Valor
Nome
Claudete Pereira         860
José Souza               470
Sônia Santos Oliveira    190

In [73]:
# Exercício 6: Faça uma consulta que mostre o(s) fornecedor(es) que tenham produtos com estoque Nulo
df = fornecedor.merge(produto, left_on='CNPJ', right_on='CNPJ_Fornecedor', how='left')

In [79]:
df[df['Estoque'].isnull()]

,CNPJ,Razao_Social,Endereco,Cidade,Codigo,Descricao,Estoque,Valor,CNPJ_Fornecedor
1,47132482000176,MicroSystem Informática,"Av. da Saudade, 98",Bauru,NaN,NaN,NaN,NaN,NaN

In [82]:
# Exercício 7: Faça uma consulta que mostre o valor total das notas por tipo de pagamento
df = pd.merge(nota, item, left_on='Numero', right_on='Numero_Nota').merge(produto, left_on='Codigo_Produto', right_on='Codigo')

In [85]:
df.groupby('Tipo_Pagto')['Valor'].sum().to_frame()

            Valor
Tipo_Pagto
A Prazo       190
A Vista      1610

In [97]:
# Refaça o exercício 2 organizando o resultado pela ordem alfabética do nome do cliente e caso o nome seja nulo, deve ser
# posicionado por último
pd.merge(nota, cliente, left_on='Codigo_Cliente', right_on='Codigo' , how='left')[['Numero', 'Data', 'Nome']].sort_values('Nome')

   Numero       Data                   Nome
0    1001 2002-05-18       Claudete Pereira
3    1004 2002-05-20             José Souza
2    1003 2002-05-19  Sônia Santos Oliveira
1    1002 2002-05-18                    NaN